app/controllers/tests_controller.rb

SELECT `test_qs`.`id` FROM `test_qs` LEFT OUTER JOIN `test_as` ON `test_as`.`test_q_id` = `test_qs`.`id`
SELECT `test_a_lists`.* FROM `test_a_lists`
SELECT `test_qs`.* FROM `test_qs`
SELECT `test_as`.`id` FROM `test_as`
---
  def index
    @test_a_lists = TestAList.includes(test_a: :test_q)
    gon.testlists = @test_a_lists
    @test_qs = TestQ.all
    @test_as = TestA.all